

#include "C_Code.h" // headers
#define PUREFUNC __attribute__((pure))
int Mod(int a, int b) PUREFUNC;

struct SkillSysBattleHit
{
    /* 00:18 */ unsigned attributes : 19;
    /* 19:23 */ unsigned info : 5;
    /* 24:31 */ signed hpChange : 8;
    u8 skillID;
    s8 cappedDmg;
    s16 overDmg;
};

typedef struct
{
    /* 00 */ PROC_HEADER;
    struct Anim * anim;
    struct Anim * anim2;
    int timer;
    struct SkillSysBattleHit * currentRound;
    struct BattleUnit * active_bunit;
    struct BattleUnit * opp_bunit;
    u8 timer2;
    u8 hitOnTime;
    u8 roundId;
    u8 adjustedDmg;
    u8 broke;
    u8 loadedImg;
    u8 side;
    u8 frame;
    u8 code4frame;
    u8 codefframe;
    u8 roundEnd;
    u8 EkrEfxIsUnitHittedNowFrames;
    u16 buttonsToPress;
} TimedHitsProc;
void LoopTimedHitsProc(TimedHitsProc * proc);
const struct ProcCmd TimedHitsProcCmd[] = {
    PROC_NAME("TimedHitsProcName"),
    PROC_YIELD,
    PROC_REPEAT(LoopTimedHitsProc),
    PROC_END,
};
typedef struct
{
    PROC_HEADER;
    u8 digits;    //   +0x29, byte. Number of digits.
    s16 damage;   //   +0x2A, short. Damage/heal value.
    u8 subjectId; //   +0x2C, byte. AISSubjectId. 0 if left, 1 if right.
} BANIM_NumsProc;
extern const struct ProcCmd * gProcScr_efxHPBar;
extern const struct ProcCmd * gProcScr_efxHPBarResire;
extern const struct ProcCmd BAN_Proc_DelayDigits[];
extern const int AlwaysWork;
extern const int MinFramesToDisplayGfx;
extern const int LenienceFrames;
extern const int BonusDamagePercent;
extern const int BonusDamageRounding;
extern const int ReducedDamageRounding;
extern const int ReducedDamagePercent;
extern const int ReducedDamageSubtract;
extern const int FailedHitDamagePercent;
extern const int UsingSkillSys;
extern const int ProcSkillsStackWithTimedHits;
extern const int DisabledFlag;
extern const int BlockingEnabled;
extern const int BlockingCanPreventLethal;
extern const int DisplayPress;
extern const int ChangePaletteWhenButtonIsPressed;
extern const u8 SkillExceptionsTable[];
extern void * Press_Image;
extern void * BattleStar;
extern void * A_Button;
extern void * B_Button;
extern void * Left_Button;
extern void * Right_Button;
extern void * Up_Button;
extern void * Down_Button;
// extern u16 gPal_Press_Image[];
// extern u16 gPal_BattleStar[];

struct TimedHitsDifficultyStruct
{
    u8 difficulty : 5;
    u8 alwaysA : 1;
    u8 off : 1;
    u8 cheats : 1;
};
extern struct TimedHitsDifficultyStruct * TimedHitsDifficultyRam;

// r0: AIS.
// r1: 0 if OverDamage or OverHeal (recipient). 1 otherwise.
// r2: X of previous damage display. 0 if there is none.
// r3: Digitcount of previous damage display. 0 if there is none.
extern int DisplayDamage2(struct Anim * anim, int overdamage, int x, int prevDigitCount, int roundId);
extern struct KeyStatusBuffer sKeyStatusBuffer; // 2024C78

int AreTimedHitsEnabled(void)
{
    if (gBattleStats.config &
        (BATTLE_CONFIG_PROMOTION | BATTLE_CONFIG_ARENA | BATTLE_CONFIG_REFRESH | BATTLE_CONFIG_MAPANIMS |
         BATTLE_CONFIG_PROMOTION_PREP | BATTLE_CONFIG_DANCERING))
    {
        return false;
    }
    if (TimedHitsDifficultyRam->off)
    {
        return false;
    }
    return !CheckFlag(DisabledFlag);
}

void InitVariables(TimedHitsProc * proc)
{
    proc->anim = NULL;
    proc->anim2 = NULL;
    proc->broke = false;
    proc->roundId = 0xFF;
    proc->timer = 0;
    proc->timer2 = 0xFF;
    proc->hitOnTime = false;
    proc->adjustedDmg = false;
    proc->loadedImg = false; // reload after each round
    proc->side = 0xFF;
    proc->currentRound = NULL;
    proc->active_bunit = NULL;
    proc->opp_bunit = NULL;
    proc->frame = 0;
    proc->roundEnd = true;
    proc->buttonsToPress = 0;
    proc->code4frame = 0xff;
    proc->codefframe = 0xff;
    proc->EkrEfxIsUnitHittedNowFrames = 0xff;
}

void StartTimedHitsProc(void)
{
    TimedHitsProc * proc;
    proc = Proc_Find(TimedHitsProcCmd);
    if (!proc)
    {
        proc = Proc_Start(TimedHitsProcCmd, (void *)3);
        InitVariables(proc);
    }
}
extern struct SkillSysBattleHit * GetCurrentRound(int roundID);
extern s16 GetAnimRoundType(struct Anim * anim);
void SetCurrentAnimInProc(struct Anim * anim)
{
    TimedHitsProc * proc;
    proc = Proc_Find(TimedHitsProcCmd);
    if (!proc)
    {
        return;
    }
    int roundId = anim->nextRoundId - 1;
    if (proc->roundId == roundId)
    {
        return;
    }
    InitVariables(proc);
    proc->roundEnd = false;
    proc->anim = anim;
    proc->anim2 = GetAnimAnotherSide(anim);
    proc->roundId = roundId;
    // proc->roundId = anim->nextRoundId > proc->anim2->nextRoundId ? anim->nextRoundId-1 : proc->anim2->nextRoundId-1;

    proc->currentRound = GetCurrentRound(proc->roundId);
    proc->side = GetAnimPosition(anim) ^ 1;
    proc->active_bunit = gpEkrBattleUnitLeft;
    proc->opp_bunit = gpEkrBattleUnitRight;
    if (!proc->side)
    {
        proc->active_bunit = gpEkrBattleUnitRight;
        proc->opp_bunit = gpEkrBattleUnitLeft;
    }
    if (!proc->loadedImg)
    {
        Copy2dChr(&Press_Image, (void *)0x06012980, 6, 2);
        Copy2dChr(&BattleStar, (void *)0x06012a40, 2, 2);   // 0x108
        Copy2dChr(&A_Button, (void *)0x06012800, 2, 2);     // 0x140
        Copy2dChr(&B_Button, (void *)0x06012840, 2, 2);     // 0x142
        Copy2dChr(&Left_Button, (void *)0x06012880, 2, 2);  // 0x144
        Copy2dChr(&Right_Button, (void *)0x060128C0, 2, 2); // 0x146
        Copy2dChr(&Up_Button, (void *)0x06012900, 2, 2);    // 0x148
        Copy2dChr(&Down_Button, (void *)0x06012940, 2, 2);  // 0x14a
        proc->loadedImg = true;
    }
}

struct NewProcEfxHPBar
{
    PROC_HEADER;

    /* 29 */ u8 death;
    /* 2A */ u8 _pad_2A[0x2C - 0x2A];
    /* 2C */ s16 pos;
    /* 2E */ s16 cur;
    /* 30 */ s16 curHpAtkrSS;
    /* 32 */ u8 _pad_30[0x48 - 0x32];
    /* 48 */ s16 diff;
    /* 4a */ s16 diffHpAtkrSS;
    /* 4C */ s16 pre;
    /* 4e */ s16 preHpAtkrSS;
    /* 50 */ s16 post;
    /* 52 */ s16 postHpAtkrSS;
    /* 54 */ int timer;
    /* 58 */ int finished;
    /* 5C */ struct Anim * anim5C;
    /* 60 */ struct Anim * anim60;
    /* 64 */ struct Anim * anim64;
};

void DoStuffIfHit(
    TimedHitsProc * proc, struct ProcEkrBattle * battleProc, struct NewProcEfxHPBar * HpProc,
    struct SkillSysBattleHit * round);
void AdjustDamageByPercent(
    TimedHitsProc * proc, struct NewProcEfxHPBar * HpProc, struct BattleUnit * active_bunit,
    struct BattleUnit * opp_bunit, struct SkillSysBattleHit * round, int percent);
void AdjustDamageWithGetter(
    TimedHitsProc * proc, struct NewProcEfxHPBar * HpProc, struct BattleUnit * active_bunit,
    struct BattleUnit * opp_bunit, struct SkillSysBattleHit * round, int success);
void CheckForDeath(
    TimedHitsProc * proc, struct NewProcEfxHPBar * HpProc, struct BattleUnit * active_bunit,
    struct BattleUnit * opp_bunit, struct SkillSysBattleHit * round, int hp, int newDamage);

const u16 sSprite_HitInput[] = {
    1, // number of entries below (each entry has 3 lines)
    0x0002, 0x4000,
    0x01ca // tile number
};
const u16 sSprite_MissedInput[] = {
